
# Read design
read_verilog ./approx_2.v

# Generic synthesis
synth -top approx_2

abc -liberty ./../../global/libfiles/ASAP_7nm_RVT_TT_master.lib

# Clean up
opt_clean -purge

# Write netlist
write_verilog -noattr ../netlists/approx_2_gate_level.v

# Generate area report
tee -o ../reports/report_approx_2.txt stat -liberty ./../../global/libfiles/ASAP_7nm_RVT_TT_master.lib
