
# Read design
read_verilog ./approx_1.v

# Generic synthesis
synth -top approx_1

abc -liberty ./../../global/libfiles/ASAP_7nm_RVT_TT_master.lib

# Clean up
opt_clean -purge

# Write netlist
write_verilog -noattr ../netlists/approx_1_gate_level.v

# Generate area report
tee -o ../reports/report_approx_1.txt stat -liberty ./../../global/libfiles/ASAP_7nm_RVT_TT_master.lib
